In [ ]:
import pandas as pd
import numpy as np

In [ ]:
obj=['오재선','전동준','전지환']
series_1=pd.Series(obj)
series_1

In [ ]:
idx=['A','B','C']
series_2=pd.Series(obj,index=idx)
series_2

In [ ]:
obj={'A':'오재선','B':'전동준','C':'전지환'}
series_3=pd.Series(obj)
series_3

In [ ]:
print(series_3.values)
print(series_3.dtype)
print(series_3.index)
print(series_3.size)

In [ ]:
series_1.index=['A','B','C']
series_1

In [ ]:
obj=(22,32,27,18,38,19)
idx=list('abcdef')
sr=pd.Series(obj,index=idx)
sr

In [ ]:
print(sr[4])
print(sr['e'])

In [ ]:
print(sr[1:5])
print(sr['b':'e'])

In [ ]:
idx=['a','c','e']
print(sr[idx])

In [ ]:
sr_1=pd.Series(range(100))
sr_1

In [ ]:
sr_1.quantile(q=0.75)

In [ ]:
sr_2=pd.Series(['a','b','c','d','b','b','c'])
sr_2.describe()

In [ ]:
sr_2.mode()

In [ ]:
obj={ '이름':['이유리','최민준','김민지'],
     '전공':['경영학과','컴퓨터공학과','데이터과학과'],
     '성별':['여','남','여'],
     '나이':[20,22,21] }
df_1=pd.DataFrame(obj)
df_1

In [ ]:
obj=np.array([['이유리','경영학과','여',20],
             ['최민준','컴퓨터공학과','남',22],
             ['김민지','데이터과학과','여',21]])
df_2=pd.DataFrame(obj)
df_2.columns=['이름','학과','성별','나이']
df_2

In [ ]:
df_3=pd.DataFrame( obj, index= ['A','B','C'], columns=['D','F','G','H'])
df_3

In [ ]:
obj={'Name':['Olivia','Lucas','Sophia','Zoe','Ava','Elliot'],
     'Sex':['Female','Male','Female','Male','Female','Male'],
     'Age':[22,32,27,18,38,19]}
df=pd.DataFrame(obj)

In [ ]:
df.values

In [ ]:
print(df.values)

In [ ]:
df.index

In [ ]:
print(df.index)

In [ ]:
df.columns

In [ ]:
df.dtypes

In [ ]:
df.shape

In [ ]:
df.info()

In [ ]:
df.Age.info()

In [ ]:
df.head()

In [ ]:
df.head(-3)

In [ ]:
df.tail(-3)

In [ ]:
idx=list('abcdef')
df=pd.DataFrame(obj,index=idx)
df

In [ ]:
df['Name']

In [ ]:
df.Name

In [ ]:
df[['Name','Age']]

In [ ]:
df.iloc[1]

In [ ]:
df.iloc[1:5]

In [ ]:
idx=[1,4]
df.iloc[idx]

In [ ]:
df.Age[0:3]

In [ ]:
df['Name'][1:3]

In [ ]:
df.iloc[0:3,:2]

In [ ]:
df.iloc[:,2]

In [ ]:
df.loc['a','Age']

In [ ]:
df.describe()

In [ ]:
df.count()

In [ ]:
df.size

In [ ]:
df.shape

In [ ]:
df.Age.mean()

In [ ]:
obj_1={'Score':[100,95,60,77,83,84]}
obj.update(obj_1)
obj

In [ ]:
df=pd.DataFrame(obj)

In [ ]:
df.sort_values(['Score'], ascending=True, inplace=False)

In [ ]:
df.sort_values('Score')

In [ ]:
df.sort_values(['Age','Score'],ascending=(True,False))

In [ ]:
rownm=['Olivia','Lucas','Sopha','Zoe','Ava','Elliot']
obj={'Score':[100,95,60,77,83,84],
     'Age':[22,22,27,18,18,19]}
df=pd.DataFrame(obj, index=rownm)
df

In [ ]:
df.sort_index()

In [ ]:
df.sort_index(axis=1)

In [ ]:
obj={'Score':[100,95,88,34,19,47,97,75,87,90,73,90,90,88,40],
     'Age':[18,19,20,19,18,22,21,20,19,20,23,22,19,18,19]}
df=pd.DataFrame(obj)
df

In [ ]:
df.sort_values(['Score'],ascending=False,inplace=True)

In [ ]:
df

In [ ]:
df['rank_avg1']=df.Score.rank()

In [ ]:
df['rank_avg2']=df.Score.rank(ascending=False)
df

In [ ]:
df['rank_min']=df.Score.rank(method='min',ascending=False)
df

In [ ]:
df['rank_max']=df.Score.rank(method='max',ascending=False)
df

In [89]:
obj_1={'student_id':['s1','s2','s3','s4','s5','s6'],
       'score':[55,90,85,71,63,99]}
df_1=pd.DataFrame(obj_1)
df_1

  student_id  score
0         s1     55
1         s2     90
2         s3     85
3         s4     71
4         s5     63
5         s6     99

In [90]:
obj_2={'student_id':['t1','t2','t3','t4','t5','t6'],
       'score':[65,99,87,75,57,88]}
df_2=pd.DataFrame(obj_2)
df_2

  student_id  score
0         t1     65
1         t2     99
2         t3     87
3         t4     75
4         t5     57
5         t6     88

In [92]:
pd.concat([df_1,df_2])

  student_id  score
0         s1     55
1         s2     90
2         s3     85
3         s4     71
4         s5     63
5         s6     99
0         t1     65
1         t2     99
2         t3     87
3         t4     75
4         t5     57
5         t6     88

In [93]:
pd.concat([df_1,df_2],axis=1)

  student_id  score student_id  score
0         s1     55         t1     65
1         s2     90         t2     99
2         s3     85         t3     87
3         s4     71         t4     75
4         s5     63         t5     57
5         s6     99         t6     88

In [96]:
obj1={'student_id':['s3','s4','s5','s6'],
      'stst_score':[85,71,83,99]}
df_1=pd.DataFrame(obj1)
df_1

  student_id  stst_score
0         s3          85
1         s4          71
2         s5          83
3         s6          99

In [97]:
obj2={'student_id':['s1','s2','s3','s4'],
      'math_score':[65,99,87,75]}
df_2=pd.DataFrame(obj2)
df_2

  student_id  math_score
0         s1          65
1         s2          99
2         s3          87
3         s4          75

In [99]:
df_1.merge(df_2)

  student_id  stst_score  math_score
0         s3          85          87
1         s4          71          75

In [101]:
df_1.merge(df_2, how='outer')

  student_id  stst_score  math_score
0         s3        85.0        87.0
1         s4        71.0        75.0
2         s5        83.0         NaN
3         s6        99.0         NaN
4         s1         NaN        65.0
5         s2         NaN        99.0

In [103]:
df_1.merge(df_2,how='right', on='student_id')

  student_id  stst_score  math_score
0         s1         NaN          65
1         s2         NaN          99
2         s3        85.0          87
3         s4        71.0          75

In [106]:
df=pd.concat([df_1,df_2])
df

  student_id  stst_score  math_score
0         s3        85.0         NaN
1         s4        71.0         NaN
2         s5        83.0         NaN
3         s6        99.0         NaN
0         s1         NaN        65.0
1         s2         NaN        99.0
2         s3         NaN        87.0
3         s4         NaN        75.0

In [116]:
df.index=[0,1,2,3,4,5,6,7]
df

  student_id  stst_score  math_score
0         s3        85.0         NaN
1         s4        71.0         NaN
2         s5        83.0         NaN
3         s6        99.0         NaN
4         s1         NaN        65.0
5         s2         NaN        99.0
6         s3         NaN        87.0
7         s4         NaN        75.0

In [119]:
obj={'student_id':['s1','s2','s3','s4','s5','s6'],
     'stat_score':[55,90,85,71,63,95],
     'math_score':[65,99,87,75,57,88],
     'sex':['Female','Male','Female','Female','Male','Male'],
     'pre_level':['B','A','B','B','C','A']}
df=pd.DataFrame(obj)
df.dtypes

student_id    object
stat_score     int64
math_score     int64
sex           object
pre_level     object
dtype: object

In [129]:
df.groupby(['sex','pre_level'])['stat_score'].mean()

sex     pre_level
Female  B            70.333333
Male    A            92.500000
        C            63.000000
Name: stat_score, dtype: float64

In [130]:
df.describe()

       stat_score  math_score
count    6.000000     6.00000
mean    76.500000    78.50000
std     15.946787    15.74484
min     55.000000    57.00000
25%     65.000000    67.50000
50%     78.000000    81.00000
75%     88.750000    87.75000
max     95.000000    99.00000

In [140]:
df.groupby('sex', as_index=False)['stat_score'].agg([np.mean,sum])

      sex       mean  sum
0  Female  70.333333  211
1    Male  82.666667  248

In [144]:
df.groupby('sex', as_index=False).agg({'stat_score':np.mean, 'math_score':sum})

      sex  stat_score  math_score
0  Female   70.333333         227
1    Male   82.666667         244

In [145]:
df.groupby('sex', as_index=False).agg({'stat_score':[np.mean,np.median], 'math_score':[sum,max]})

      sex stat_score        math_score
                mean median        sum max
0  Female  70.333333   71.0        227  87
1    Male  82.666667   90.0        244  99